Revit 2027 API
ExporterIFCUtils.GetGlobal3DDirectionHandles Method
Note: This API is now obsolete.
 Obtains the handles representing the cardinal directions in 3D.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This function is deprecated in Revit 2027.  Get one direction handle at a time.")]
public static IList<IFCAnyHandle> GetGlobal3DDirectionHandles(
	bool positive
)
<ObsoleteAttribute("This function is deprecated in Revit 2027.  Get one direction handle at a time.")>
Public Shared Function GetGlobal3DDirectionHandles (
	positive As Boolean
) As IList(Of IFCAnyHandle)
public:
[ObsoleteAttribute(L"This function is deprecated in Revit 2027.  Get one direction handle at a time.")]
static IList<IFCAnyHandle^>^ GetGlobal3DDirectionHandles(
	bool positive
)
[<ObsoleteAttribute("This function is deprecated in Revit 2027.  Get one direction handle at a time.")>]
static member GetGlobal3DDirectionHandles :
        positive : bool -> IList<IFCAnyHandle>
Parameters
positive Boolean
 True if the handles returned should be in the positive direction, false if the handles should be in the negative direction.
Return Value
IList<IFCAnyHandle>
 The collection of handles.
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace